Revit 2027 API
View3D.IsLocked Property
 Indicates if the view is locked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLocked { get; }
Public ReadOnly Property IsLocked As Boolean
	Get
public:
property bool IsLocked {
	bool get ();
}
member IsLocked : bool with get
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Returns true if the view is not a view template.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace